*> This is free-form
IDENTIFICATION DIVISION.
PROGRAM-ID. AUTH.
AUTHOR. Washington.
DATE-WRITTEN. 09/06/2025.

ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
               SELECT USERINFO ASSIGN TO "userinfo.dat"
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS UINFO-FILE-STATUS.

               SELECT USERACTIONS ASSIGN TO "useractions.dat"
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS UACTIONS-FILE-STATUS.

DATA DIVISION.
       FILE SECTION.
           FD USERINFO.
               01 USER-REC.
                   05 IN-USERNAME PIC X(20).
                   05 IN-PASSWORD PIC X(20).

           FD USERACTIONS.
               01 ACTION-REC PIC X(20).

       WORKING-STORAGE SECTION.
           01 UINFO-FILE-STATUS PIC XX.
           01 UACTIONS-FILE-STATUS PIC XX.
           01 INFOEOF PIC A(1).
           01 ACTIONSEOF PIC A(1).

       01     INPUT-ACTION Pic X(20).
       01     CURRENT-ACTION Pic X(20).
       01     INFO Pic X(20).
       01     WS-LOGIN Pic A(5) VALUE 'LOGIN'.
       01     WS-NEW Pic A(18) VALUE 'CREATE NEW ACCOUNT'.

PROCEDURE DIVISION.
    OPEN INPUT USERINFO.
    OPEN INPUT USERACTIONS.
    IF UINFO-FILE-STATUS NOT = "00"
       DISPLAY "ERROR OPENING FILE: " UINFO-FILE-STATUS.
       STOP RUN.

    IF UINFO-FILE-STATUS NOT = "00"
       DISPLAY "ERROR OPENING FILE: " UACTIONS-FILE-STATUS.
       STOP RUN.

    DISPLAY "Welcome to InCollege!".
    DISPLAY "Log In".
    DISPLAY "Create New Account".

    PERFORM UNTIL ACTIONSEOF='Y'
       READ USERACTIONS INTO INPUT-ACTION
           EVA

           AT END MOVE 'Y' TO ACTIONSEOF
           NOT AT END DISPLAY 'g'
       END-READ
    END-PERFORM

    CLOSE USERINFO
    CLOSE USERACTIONS
    STOP RUN.
