*> This is free-form
IDENTIFICATION DIVISION.
PROGRAM-ID. InCollege.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
    DISPLAY "Hello from GNU COBOL in Docker + VS Code!".
    STOP RUN.
